import re


dict_narrow = {r"-": "",
            r"\+": "́",
            r"́([аеиіоуяюєї])": r"\1́",
            "щ": "шч",
            "ь": "´",
            "['’]": "f",
            "дз": "q",
            "дж": "s",
            "я": "jа",
            "ю": "jу",
            "є": "jе",
            "ї": "jі",
            "(?<=[дзлнрстцq])j": "´",
            "(?<=[бвгжкмпфхчшґs])j": "'",
            "й": "j",
            "(?<=[дзлнрстцq])і": "´і",
            "f": "",
            "т´с(?=´а)": "ц´ц",
            "(?<=с)ц(?=´ц)": "",
            "(?<=д)[шч](?=с)": "",
            "ст(?=с´к)": "",
            "(?<=[сшн])т(?=[чцдс])": "",
            "тс(?=´к|тв)": "ц",
            "(?<=с)т(?=н)": "",
            "(?<=з)д(?=ц)": "",
            r"(?:(?<=на|ві|пі)|(?<=[сп]ере))(́?)q": r"\1qз",
            r"(?:(?<=\sна|\sві)|(?<=пі|^на|^ві)|(?<=\sпере)|(?<=^пере))(́?)s": r"\1sж",
            r"(?:(?<=\sі|^не|^по)|(?<=\sне|\sпо)|(?<=\s|^і)|(?<=^))(́?)з(?=[сцчш])": r"\1с",
            "п(?=[бдзжгґqs])": "б",
            "к(?=[бдзжгґqs])": "ґ",
            "х(?=[бдзжгґqs])": "г",
            "т(?=´?[бдзжгґqs])": "д",
            "с(?=´?[бдзжгґqs])": "з",
            "ш(?=[бдзжгґqs])": "ж",
            "ц(?=´?[бдзжгґqs])": "q",
            "ч(?=[бдзжгґqs])": "s",
            "[дs](?=´?[цзсq])": "q",
            "[тч](?=´?[цзсq])": "ц",
            "[дq]´?(?=[чжшs])": "s",
            "[тц]´?(?=[чжшs])": "ч",
            "з´?(?=[чжшs])": "ж",
            "с´?(?=[чжшs])": "ш",
            "ж(?=[зсцq])": "з",
            "ш(?=[зсцq])": "с",
            r"(?:(?<=н´і)|(?<=во|ле|де|кі)|(?<=д´[оі]))(́?)г(?=[кт])": r"\1х",
            "(?<=[дтнзсцлq])(?=[дтнзсцлq]´)": "´",
            "в(?!['аоеуіи])": "ў",
            r"(?<=[^́аеоуиі ])ў(?=\s|$)": "в",
            "ф(?=[бдзжгґqs])": "в",
            "(?<=[бвгжкмпфхчшґs])і": "'і",
            r"([бвгґжкпфхчшрмs])\1'": r"\1'\1'",
            r"рр´": r"р´р´",
            "q": "д͡з",
            "s": "д͡ж"}



dict_ipa = {"д͡з": "ʣ",
            "д͡ж": "ʤ",
            "ч": "ʧ",
            "ц": "ʦ",
            "л´": "lʲ",
            "л": "ɫ",
            "в(?=[оу])": "w",
            "в": "v",
            "р": "r",
            "б": "b",
            "г": "ɦ",
            "ґ": "g",
            "д": "d",
            "ж": "ʒ",
            "з": "z",
            "к": "k",
            "м": "m",
            "н": "n",
            "п": "p",
            "с": "s",
            "т": "t",
            "ф": "f",
            "х": "x",
            "ш": "ʃ",
            "а": "ɑ",
            "е": "ɛ",
            "и": "ɪ",
            "і": "i",
            "о": "o",
            "у": "u",
            "ў": "w",
            "['´]": "ʲ",
            r"([ɑɛɪiou])́": r"'\1"}



class Transcriptor:
    def __init__(self, text):
        self.text = text

    def transcribe(self):
        allophone = self.text.lower()
        for pattern1, subst1 in dict_narrow.items():
            allophone = re.sub(pattern1, subst1, allophone)
        return allophone

    def to_ipa(self):
        ipa = self.transcribe()
        for pattern, subst in dict_ipa.items():
            ipa = re.sub(pattern, subst, ipa)
        return ipa


if __name__ == "__main__":
    text = "старов+инний кам'ян+ий з+амок височ+ів н+а верш+ині гор+и"
    transcriptor = Transcriptor(text)

    print(transcriptor.to_ipa())
